-- 创建数据库
SET NAMES UTF8;
DROP DATABASE IF EXISTS hy;
CREATE DATABASE hy CHARSET=UTF8;
USE hy;
-- 建立数据表保持首页数据
CREATE TABLE hy_home(
    hid INT PRIMARY KEY AUTO_INCREMENT,
    hname VARCHAR(128),
    title VARCHAR(128),
    price VARCHAR(12),
    img VARCHAR(128),
    stock VARCHAR(12)
);
INSERT INTO hy_home VALUES
(NULL,"轮播图1","第一张",0,"http://127.0.0.1:3000/img/lunbo1.jpg",0),
(NULL,"轮播图2","第2张",0,"http://127.0.0.1:3000/img/lunbo2.jpg",0),
(NULL,"轮播图3","第3张",0,"http://127.0.0.1:3000/img/lunbo3.jpg",0);
CREATE TABLE hy_home_content(
    hid INT PRIMARY KEY AUTO_INCREMENT,
    nid SMALLINT,
    hname VARCHAR(128),
    price VARCHAR(12),
    title VARCHAR(500),
    img VARCHAR(128),
    stock VARCHAR(12)
);
-- 分类送女友  nid=1 
INSERT INTO hy_home_content VALUE
(NULL,1,"一往情深-精品玫瑰礼盒:19枝红玫瑰",237,"你的轻柔像阵微风，让我从容不迫，想让你知道，我对你始终一往情深。","http://127.0.0.1:3000/img/9010966.jpg",98),
(NULL,1,"我只钟情你-香槟玫瑰11枝、白色小雏菊3枝 错落有致 甜蜜纯洁",231,"香槟玫瑰清新、脱俗，品位独特！让我们乘着芬芳的清风，手牵着手走过四季春秋。","http://127.0.0.1:3000/img/9012223.jpg",97),
(NULL,1,"一心一意-玫瑰11枝，粉色勿忘我0.3扎 经典款式 精选爆款",135,"11枝玫瑰，寓意一心一意！<br>有情之人，天天是节。一句寒暖，一线相喧；一句叮咛，一笺相传；一份相思，一心相盼；一份爱意，一生相恋。","http://127.0.0.1:3000/img/9010011.jpg",96),
(NULL,1,"不变的承诺-99枝红玫瑰 经典99枝，鼎力推荐！",626,"下雨的时候，给她撑一把雨伞；寒冷的时候，给她一个温暖的臂弯；天黑了，永远有一盏灯为她点亮；晨起时，给她一缕温暖的阳光。爱她，就送她一束99枝的玫瑰花！","http://127.0.0.1:3000/img/9012177.jpg",95),
(NULL,1,"忘情巴黎-33枝红玫瑰 浪漫唯美 女神挚爱
",321,"只想和你忘掉一切烦恼，尽情沉醉在最浪漫的气氛中。","http://127.0.0.1:3000/img/9012009.jpg",99),
(NULL,1,"爱在心头-玫瑰50枝：戴安娜粉玫瑰19枝，红玫瑰31枝 双色搭配 赏心悦目",388,"“此情无计可消除，才下眉头，却上心头。”李清照《一剪梅》","http://127.0.0.1:3000/img/9010855.jpg",99),
(NULL,1,"如沐春风/自然风抱桶花-粉佳人玫瑰11枝 清新风格 暖春最佳
",175,"我会一直在你身旁，给你如沐春风般的温暖。","http://127.0.0.1:3000/img/9012371.jpg",99),
(NULL,1,"如沐春风/自然风抱桶花-粉佳人玫瑰11枝 清新风格 暖春最佳
",126,"我会一直在你身旁，给你如沐春风般的温暖。","http://127.0.0.1:3000/img/9012223.jpg",99),

(NULL,1,"赤道花园- 红色玫瑰（红拂）19枝，尤加利叶 高端鲜花
",587,"在靠近赤道的地方，触及“彩虹”！","http://127.0.0.1:3000/img/9012300.jpg",99),

(NULL,1,"爱你如初-雪山白玫瑰66枝 
",518,"岁月匆匆如白驹过隙，即使时光往复，我依然爱你如初。","http://127.0.0.1:3000/img/9012273.jpg",99),

(NULL,1,"真爱-红玫瑰9枝，石竹梅4枝，栀子叶0.5扎 畅销款特惠
",126,"我用回忆温暖了想你的每一刻<br>不让你离我太遥远<br>走在这个适合拥抱的季节<br>爱在心裡所以我不可怜<br>紧紧抱着你说过的誓言<br> 等待着我们说好的永远<br>","http://127.0.0.1:3000/img/9010845.jpg",99),

(NULL,1,"温柔如你-戴安娜粉玫瑰12枝，石竹梅7枝 
",198,"走在风中今天阳光，突然好温柔，天的温柔，地的温柔，像你抱着我，把我最好的爱给你，是我全部的温柔,","http://127.0.0.1:3000/img/9012112.jpg",99);
-- 分类送男友  nid=2 
INSERT INTO hy_home_content VALUE
(NULL,2,"邂逅你的美-白玫瑰9枝，橙色多头玫6枝 配色鲜明 送礼优选
",196,"想和你在阳光的午后赏花喝茶，想和你在落日的傍晚谈天说地，用这一束灿烂温暖你的圣诞！","http://127.0.0.1:3000/img/9012376.jpg",99),
(NULL,2,"向日葵之歌-向日葵6枝 ",185,"采一束阳光，制成书签，每一天都有温暖入怀。","http://127.0.0.1:3000/img/9012072.jpg",99),
(NULL,2,"一缕清香-向日葵3枝，白色洋桔梗0.5扎 
",194,"当你想我的时候，我会化作一缕温柔的清风，轻轻靠在你背后，温暖你的所有。","http://127.0.0.1:3000/img/9092149.jpg",99),
(NULL,2,"心向暖阳-向日葵2枝，香槟玫瑰6枝 
",181,"心向暖阳，静待花开。","http://127.0.0.1:3000/img/9012345.jpg",99),
(NULL,2,"晴朗-香槟玫瑰11枝，向日葵2枝，绿色桔梗5枝，绿色小菊3枝，叶上花3枝",237,"你的心，蔚蓝得，温暖得，透出了光芒；宇宙里，陨落的，失踪的，天使又歌唱。月光找到了海洋，生命找来了时光。","http://127.0.0.1:3000/img/9012070.jpg",99),
(NULL,2,"阳光海岸-19枝香槟玫瑰 98%好评率，热销推荐
",223,"和你手牵手漫步海边，在沙滩上画两颗心，心心相印，永不分离","http://127.0.0.1:3000/img/9012011.jpg",99),
(NULL,2,"香妃-香槟玫瑰9枝 清新脱俗
",185,"你的香气，是我思念的味道，那是最独特的。9朵香槟玫瑰，是天长地久的爱情，专属你我之间的真爱，无期限，永不凋零！","http://127.0.0.1:3000/img/9012056.jpg",99),
(NULL,2,"如初-19枝白玫瑰，紫色勿忘我5枝 特惠款
",201,"还记得第一次我们约会吗？那晚的星光格外美，我的心也快要沸腾。","http://127.0.0.1:3000/img/9012039.jpg",99);
-- 送恋人 nid=3
INSERT INTO hy_home_content VALUE
(NULL,195,"缘份-11枝红玫瑰,2枝多头白香水百合 寓意成双成对 百年好合
",201,"红玫瑰+百合，热烈而馨香，遇到你纯属偶然，谁能说清比缘份更深的东西，我的转身你成了我的风景，有一种惊喜暗藏于心。","http://127.0.0.1:3000/img/9010849.jpg",99),
(NULL,215,"牵手一生-红玫瑰19枝 精选材料 简约搭配
",201,"19枝红玫瑰寓意：永远爱你此情不渝。想念那条街,想念与你遇见的地方,想念和你的第一次牵手……永远无法忘记这些往昔的喜悦,它将永驻心间！","http://127.0.0.1:3000/img/9010731.jpg",99),
(NULL,3,"用心爱你-99枝：33枝戴安娜＋66枝红玫瑰
",666,"不管时空怎么转变，世界怎么改变，你的爱总在我心间。","http://127.0.0.1:3000/img/9092112.jpg",99),
(NULL,3,"嫁给我吧- 戴安娜粉玫瑰108枝 表白求婚神器！
",688,"108朵玫瑰，每一朵都在细诉无尽的爱，每一朵都是我在对你说：“嫁给我吧！”","http://127.0.0.1:3000/img/9012150.jpg",99),
(NULL,3,"LOVE 99-99枝精品红玫瑰花束 99枝玫瑰特惠款
",626,"","http://127.0.0.1:3000/img/9012042.jpg",99),
(NULL,3,"永恒的爱情-红玫瑰99枝 表白求婚利器！
",666,"“世界上万物也许会消亡，永恒的爱情天长地久。”巴基斯坦的民歌《永恒的爱情》，唱出了爱的真谛，也唱出了世界人民共同的心声。","http://127.0.0.1:3000/img/9012041.jpg",99),
(NULL,3,"爱在心头-玫瑰50枝：戴安娜粉玫瑰19枝，红玫瑰31枝 双色搭配 赏心悦目",388,"“此情无计可消除，才下眉头，却上心头。”李清照《一剪梅》","http://127.0.0.1:3000/img/9010855.jpg",99),
(NULL,3,"爱你如初-雪山白玫瑰66枝 
",518,"岁月匆匆如白驹过隙，即使时光往复，我依然爱你如初。","http://127.0.0.1:3000/img/9012273.jpg",99);
-- 送长辈 nid=4
INSERT INTO hy_home_content VALUE
(NULL,4,"母爱-紫红色康乃馨9枝，粉色多头康乃馨10枝
",172,"没你疼爱我怎么生活，没你抚养我怎能长大，你给了我青春的年华，自己却满头白发，不负青春年华，是对你最好的报答！","http://127.0.0.1:3000/img/9012092.jpg",99),
(NULL,4,"幸福绽放-粉色康乃馨19枝
",165,"携带一束鲜花来到您的身旁，花儿浓缩了我对您的祝福，您在我的心里永远美丽、漂亮！","http://127.0.0.1:3000/img/9012095.jpg",99),
(NULL,4,"感激-29枝红康乃馨,2枝多头粉百合 多花材搭配
",214,"常怀感恩之心的人是最幸福的，<br>常怀感激之情的生活是最甜美的！","http://127.0.0.1:3000/img/9010736.jpg",99),
(NULL,4,"圆满-粉百合2枝、红玫瑰9枝、红色康乃馨15枝 花的海洋 送礼百搭
",276,"载着寓意希望的鲜花驶向快乐幸福的彼岸…… 
用途：祝福、感谢、探望、访友","http://127.0.0.1:3000/img/9010766.jpg",99),

(NULL,4,"幸福满溢-多头百合2枝，卡罗拉玫瑰8枝，红太阳花6枝 
",233,"微微的秋意带走了盛夏的酷暑，带不走我关注你的脚步，愿你快乐幸福满溢！","http://127.0.0.1:3000/img/9012334.jpg",99),
(NULL,4,"留住好时光-粉绣球1枝，粉雪山玫瑰6枝 精选昆明A级花材
",233,"让每点阳光，洒于你脸庞；令你的微笑，比花更盛放！","http://127.0.0.1:3000/img/9012332.jpg",99);
-- 购物车数据
CREATE TABLE hy_shopcart(
    sid INT PRIMARY KEY AUTO_INCREMENT,
    sname VARCHAR(64),
    price VARCHAR(12),
    img VARCHAR(128),
    hid INT,
    lid INT,
    count INT,
    checked VARCHAR(32)
);
